ingred = [
    ('양파',10,'개',10000,1000),
    ('닭',1,'마리',6000,6000),
    ('파',5,'개',1500,300),
    ('생강',20,'개',5000,250),
    ('고추',10,'개',10000,1000),
    ('가지',1,'개',2000,2000),
    ('오징어',1,'마리',5000,5000)    
]

recipe = [
    # ['불닭','양파',2],
    # ['불닭','닭',1],
    # ['불닭','파',2],
    ('오징어볶음','오징어',3),
    ('오징어볶음','파',2),
    ('오징어볶음','양파',3),
    ('오징어볶음','고추',2)
]
menu_name = [
    ['불닭','한식',40],
    ['오징어볶음','한식',120]
]


import sqlite3

conn = sqlite3.connect('test.db')

cur = conn.cursor()

cur.executemany(
    'INSERT INTO menu VALUES (?,?,?)',
    menu_name
)

conn.commit()






